* TD4_91b
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                           | TD4_91b
Place Name                            | Paakitsoq
Geographic Location                   | Central West Greenland
Ice Type                              | 
Data Reference                        | Unknown PDF: See td1
Data DOI                              | 
Science Reference                     | Thomsen, H.H., O.B. Olesen, R.J. Braithwaite, and C.E. Bøggild. 1991. Ice drilling and mass balance at Pakitsoq, Jakobshavn, central West Greenland. Rapport Grønlands Geologiske Undersøgelse, 152, 80–84. 
Science DOI                           | 10.34194/rapggu.v152.8160
Date                                  | 1991-08-28
Longitude [°E]                        | -49.68
Latitude [°N]                         | 69.53
Location source                       | Colgan2021
Depth of top measurement [m]          | 3.0
Depth of bottom measurement [m]       | 493.0
Ice thickness [m]                     | 600.0
Coverage [% of thickness]             | 82
Ice thickness source                  | Estimate. lower bound Unknown PDF, upper bound BedMachine_V3
Measured from: Top, Bottom, Relative  | T
General_Note                          | 
Temperature_note                      | 
Thickness_note                        | 
Location_note                         | 
#+end_example

** Temperature

+ See td1 Shallow88II.pdf

** Thickness

+ From PDF
 
** Location

+ From PDF. Same location as td41. Unknown if same borehole.

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv
#+END_SRC

#+RESULTS: ingest_data
|   d |     t |
|   3 | -12.7 |
|   8 |   -11 |
|  13 |  -8.1 |
|  33 |  -6.5 |
| 108 |  -6.3 |
| 183 |  -5.9 |
| 298 |    -5 |
| 373 |  -4.3 |
| 448 |  -3.8 |
| 488 |  -2.4 |
| 493 |  -5.5 |

